       IDENTIFICATION DIVISION.
       PROGRAM-ID. "TP_PARTE1_B".

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       SELECT ALQUILERESMAE
           ASSIGN TO DISK "Files/alquileres.dat"
           ORGANIZATION IS LINE SEQUENTIAL
           FILE STATUS IS FS-ALQUILERESMAE.

       SELECT AUTOS
           ASSIGN TO DISK "Files/autos.dat"
           ORGANIZATION IS LINE SEQUENTIAL
           FILE STATUS IS FS-AUTOS.

       SELECT ESTADISTICAS
           ASSIGN TO DISK "Files/estadisticas.txt"
           ORGANIZATION IS LINE SEQUENTIAL
           FILE STATUS IS FS-ESTADISTICAS.


       DATA DIVISION.
       FILE SECTION.

       FD ALQUILERESMAE
           LABEL RECORD IS STANDARD.
       01 ALQUILERESMAE-REC.
           03 ALQ-PATENTE      PIC X(6).
           03 ALQ-FECH.
               05  FECHA-DD    PIC 9(2).
               05  FECHA-MM    PIC 9(2).
               05  FECHA-AA    PIC 9(4).
           03 FILLER           PIC X(28).


       FD AUTOS
           LABEL RECORD IS STANDARD.
       01 AUTOS-REC.
           03 AUT-PATENTE      PIC X(6).
           03 FILLER           PIC X(30).
           03 AUT-MARCA        PIC X(20).
           03 FILLER           PIC X(18).


       FD ESTADISTICAS
           LABEL RECORD IS STANDARD.
       01 ESTADISTICAS-REC.
           03 FILLER           PIC X(80).

       WORKING-STORAGE SECTION.

       01 FS-ALQUILERESMAE     PIC XX.
           88 EOFALQUILERES             VALUE "10".

       01 FS-AUTOS             PIC XX.
           88  EOFAUTOS                 VALUE "10".

       01 FS-ESTADISTICAS      PIC XX.

       01 FECHA-DE-HOY.
           03  FECHA-AAAA      PIC 9(4).
           03  FECHA-MM        PIC 9(2).
           03  FECHA-DD        PIC 9(2).

       01 CANT-LINEAS-POR-PAG     PIC 9(2)    VALUE 60.

       01 WS-HOJA                 PIC 9(3)    VALUE 001.
       01 WS-NRO-LINEA            PIC 9(2)    VALUE 00.
       01 WS-INDICE-VECMARCAS                  PIC 9(3).
       01 WS-TOTAL-GENERAL        PIC 9(5)    VALUE 00000.
       01 WS-INDICE-MARCA         PIC 9(3).
       01 WS-I                    PIC 9(3).
       01 WS-MAXAUTOS             PIC 9(3)     VALUE 300.
       01 WS-MARCA        PIC X(20).

       01 DETALLE.
           03 MARCA            PIC X(20).
           03 FILLER           PIC X(4) VALUE SPACES.
           03 DET-ENE          PIC 9(3).
           03 FILLER           PIC X(1) VALUE SPACES.
           03 DET-FEB          PIC 9(3).
           03 FILLER           PIC X(1) VALUE SPACES.
           03 DET-MAR          PIC 9(3).
           03 FILLER           PIC X(1) VALUE SPACES.
           03 DET-ABR          PIC 9(3).
           03 FILLER           PIC X(1) VALUE SPACES.
           03 DET-MAY          PIC 9(3).
           03 FILLER           PIC X(1) VALUE SPACES.
           03 DET-JUN          PIC 9(3).
           03 FILLER           PIC X(1) VALUE SPACES.
           03 DET-JUL          PIC 9(3).
           03 FILLER           PIC X(1) VALUE SPACES.
           03 DET-AGO          PIC 9(3).
           03 FILLER           PIC X(1) VALUE SPACES.
           03 DET-SEP          PIC 9(3).
           03 FILLER           PIC X(1) VALUE SPACES.
           03 DET-OCT          PIC 9(3).
           03 FILLER           PIC X(1) VALUE SPACES.
           03 DET-NOV          PIC 9(3).
           03 FILLER           PIC X(1) VALUE SPACES.
           03 DET-DEC          PIC 9(3).
           03 FILLER           PIC X(1) VALUE SPACES.
           03 DET-TOTAL        PIC 9(4).

       01 ENCABEZADO1.
           03  FILLER      PIC X(9)    VALUE "FECHA: ".
           03  FECHA-DD    PIC 9(2).
           03  FILLER      PIC X(1)    VALUE "/".
           03  FECHA-MM    PIC 9(2).
           03  FILLER      PIC X(1)   VALUE "/".
           03  FECHA-AAAA  PIC 9(4).
           03  FILLER      PIC X(50)   VALUE SPACES.
           03  FILLER      PIC X(6)    VALUE "HOJA: ".
           03  E1HOJA      PIC 9(3).

       01 ENCABEZADO2.
          03 FILLER           PIC X(16) VALUE SPACES.
          03 FILLER           PIC X(41) VALUE
          "LISTADO ESTADISTICO DE ALQUILERES POR MES".
          03 FILLER           PIC X(23) VALUE SPACES.
       01 ENCABEZADO3      PIC X(80)   VALUE ALL SPACES.
       01 ENCABEZADO4.
          03 FILLER           PIC X(40) VALUE
          "MARCA                   ENE FEB MAR ABR ".
          03 FILLER           PIC X(40) VALUE
          "MAY JUN JUL AGO SEP OCT NOV DIC TOTAL   ".
       01 ENCABEZADO5      PIC X(80)   VALUE ALL "-".


       01 MATRIZMARCAXMESM.
           03 MATRIZMARCAXMES OCCURS 300 TIMES.
                05  MATRIZMARCAXMES-COL     OCCURS  12 TIMES.
                    07  MATRIZMARCAXMES-ELEM    PIC 9(3) VALUE 000.

       01 VECMARCASM.
           03 VECMARCAS OCCURS 300 TIMES
                   ASCENDING KEY IS VEC-MARCA
                   INDEXED BY IND.
                   05  VEC-MARCA       PIC X(20).

       01 VECAUTOSM.
           03 VECAUTOS OCCURS 300 TIMES
                   ASCENDING KEY IS VEC-AUT-PATENTE
                   INDEXED BY IND2.
                   05  VEC-AUT-PATENTE     PIC X(6).
                   05  VEC-AUT-MARCA       PIC X(20).       *> SE USA PARA LUEGO SABER LA MARCA DE UN AUTO POR SU PATENTE

       01 VECTOTALMENSUAL.
           03  VECTOTALMENSUAL-ELEM    OCCURS 12 TIMES PIC 9(4).


       01 VECTOTALMARCA.
           03  VECTOTALMARCA-ELEM      OCCURS 300 TIMES PIC 9(4).

       PROCEDURE DIVISION.
           PERFORM ABRIR-ARCHIVOS.
           PERFORM CARGAR-MARCAS.
           PERFORM IMP-ENCABEZADO-ESTADISTICAS.
           PERFORM CALCULAR-ESTADISTICAS.
           PERFORM IMPRIMIR-MATRIZ-MARCA-MES.
           PERFORM IMP-TOTS-MENSUALES-Y-GRAL.
           PERFORM CERRAR-ARCHIVOS.
           ACCEPT WS-INDICE-VECMARCAS.
           STOP RUN.

       ABRIR-ARCHIVOS.
           OPEN INPUT ALQUILERESMAE.
           IF (FS-ALQUILERESMAE <> 00)
               DISPLAY "ERROR AL ABRIR ARCHIVO DE ALQUILERES: "
               FS-ALQUILERESMAE
               ACCEPT WS-INDICE-VECMARCAS
               STOP RUN
           END-IF.
           OPEN INPUT AUTOS.
           IF (FS-AUTOS <> 00)
               CLOSE ALQUILERESMAE
               DISPLAY "ERROR AL ABRIR ARCHIVO DE AUTOS: " FS-AUTOS
               ACCEPT WS-INDICE-VECMARCAS
               STOP RUN
           END-IF.
           OPEN OUTPUT ESTADISTICAS.

       CARGAR-MARCAS.

           PERFORM LEER-AUTOS.
           SET IND2 TO 1.
           MOVE 1 TO WS-INDICE-VECMARCAS.
           PERFORM CARGAR-VECTOR-MARCAS
               UNTIL EOFAUTOS OR WS-INDICE-VECMARCAS > WS-MAXAUTOS.


       LEER-AUTOS.
           READ AUTOS RECORD.

       LEER-ALQUILERESMAE.
           READ ALQUILERESMAE RECORD.

       CARGAR-VECTOR-MARCAS.

           MOVE AUT-MARCA TO VEC-AUT-MARCA(IND2).
           MOVE AUT-PATENTE TO VEC-AUT-PATENTE(IND2).
           ADD 1 TO IND2.

           SET IND TO 1.
           SEARCH VECMARCAS
               AT END
                   MOVE AUT-MARCA TO VEC-MARCA(WS-INDICE-VECMARCAS)
                   ADD 1 TO WS-INDICE-VECMARCAS
               WHEN AUT-MARCA = VEC-MARCA(IND)
           PERFORM LEER-AUTOS.

       IMP-ENCABEZADO-ESTADISTICAS.
           MOVE FUNCTION CURRENT-DATE TO FECHA-DE-HOY.
           MOVE CORRESPONDING FECHA-DE-HOY TO ENCABEZADO1.
           MOVE WS-HOJA TO E1HOJA.
           DISPLAY ENCABEZADO1.
           MOVE ENCABEZADO1 TO ESTADISTICAS-REC.
           WRITE ESTADISTICAS-REC.

           DISPLAY ENCABEZADO2.
           MOVE ENCABEZADO2 TO ESTADISTICAS-REC.
           WRITE ESTADISTICAS-REC.

           DISPLAY ENCABEZADO3.
           MOVE ENCABEZADO3 TO ESTADISTICAS-REC.
           WRITE ESTADISTICAS-REC.

           DISPLAY ENCABEZADO4.
           MOVE ENCABEZADO4 TO ESTADISTICAS-REC.
           WRITE ESTADISTICAS-REC.

           DISPLAY ENCABEZADO5.
           MOVE ENCABEZADO5 TO ESTADISTICAS-REC.
           WRITE ESTADISTICAS-REC.

           ADD 5 TO WS-NRO-LINEA.

       CALCULAR-ESTADISTICAS.
           PERFORM LEER-ALQUILERESMAE.
           PERFORM PROCESO UNTIL EOFALQUILERES.

       PROCESO.
           SET IND2 TO 1.
           SET IND TO 1.
           MOVE CORRESPONDING ALQ-FECH TO FECHA-DE-HOY.
           SEARCH VECAUTOS
               WHEN ALQ-PATENTE = VEC-AUT-PATENTE(IND2)
                   MOVE VEC-AUT-MARCA(IND2) TO WS-MARCA
           END-SEARCH.

           SEARCH VECMARCAS
               WHEN WS-MARCA = VEC-MARCA(IND)
                   SET WS-INDICE-MARCA TO IND
           END-SEARCH.

           ADD 1 TO MATRIZMARCAXMES-ELEM(WS-INDICE-MARCA, FECHA-MM OF
           FECHA-DE-HOY).
           ADD 1 TO VECTOTALMENSUAL-ELEM(FECHA-MM OF FECHA-DE-HOY).
           ADD 1 TO VECTOTALMARCA-ELEM(WS-INDICE-MARCA).
           ADD 1 TO WS-TOTAL-GENERAL.

           PERFORM LEER-ALQUILERESMAE.

       IMPRIMIR-MATRIZ-MARCA-MES.
           MOVE 1 TO WS-I.
           PERFORM IMPRIMIR-FILA-MARCA
               UNTIL WS-I > WS-MAXAUTOS OR VECMARCAS(WS-I) = "".

       IMPRIMIR-FILA-MARCA.
           PERFORM IMPRIMIR-COL-MES
               UNTIL WS-I > WS-MAXAUTOS OR VECMARCAS(WS-I) = "".

       IMPRIMIR-COL-MES.
           MOVE VECMARCAS(WS-I) TO MARCA.
           MOVE MATRIZMARCAXMES-COL(WS-I, 1) TO DET-ENE.
           MOVE MATRIZMARCAXMES-COL(WS-I, 2) TO DET-FEB.
           MOVE MATRIZMARCAXMES-COL(WS-I, 3) TO DET-MAR.
           MOVE MATRIZMARCAXMES-COL(WS-I, 4) TO DET-ABR.
           MOVE MATRIZMARCAXMES-COL(WS-I, 5) TO DET-MAY.
           MOVE MATRIZMARCAXMES-COL(WS-I, 6) TO DET-JUN.
           MOVE MATRIZMARCAXMES-COL(WS-I, 7) TO DET-JUL.
           MOVE MATRIZMARCAXMES-COL(WS-I, 8) TO DET-AGO.
           MOVE MATRIZMARCAXMES-COL(WS-I, 9) TO DET-SEP.
           MOVE MATRIZMARCAXMES-COL(WS-I, 10) TO DET-OCT.
           MOVE MATRIZMARCAXMES-COL(WS-I, 11) TO DET-NOV.
           MOVE MATRIZMARCAXMES-COL(WS-I, 12) TO DET-DEC.
           MOVE VECTOTALMARCA-ELEM(WS-I) TO DET-TOTAL.
           DISPLAY DETALLE.
           MOVE DETALLE TO ESTADISTICAS-REC.
           WRITE ESTADISTICAS-REC.
           ADD 1 TO WS-I.

           PERFORM CHEQUEO-CAMBIO-PAGINA.


       IMP-TOTS-MENSUALES-Y-GRAL.
           DISPLAY ENCABEZADO3.
           MOVE ENCABEZADO3 TO ESTADISTICAS-REC.
           WRITE ESTADISTICAS-REC.

           PERFORM CHEQUEO-CAMBIO-PAGINA.

           MOVE "TOTALES" TO MARCA.
           MOVE VECTOTALMENSUAL-ELEM(1) TO DET-ENE.
           MOVE VECTOTALMENSUAL-ELEM(2) TO DET-FEB.
           MOVE VECTOTALMENSUAL-ELEM(3) TO DET-MAR.
           MOVE VECTOTALMENSUAL-ELEM(4) TO DET-ABR.
           MOVE VECTOTALMENSUAL-ELEM(5) TO DET-MAY.
           MOVE VECTOTALMENSUAL-ELEM(6) TO DET-JUN.
           MOVE VECTOTALMENSUAL-ELEM(7) TO DET-JUL.
           MOVE VECTOTALMENSUAL-ELEM(8) TO DET-AGO.
           MOVE VECTOTALMENSUAL-ELEM(9) TO DET-SEP.
           MOVE VECTOTALMENSUAL-ELEM(10) TO DET-OCT.
           MOVE VECTOTALMENSUAL-ELEM(11) TO DET-NOV.
           MOVE VECTOTALMENSUAL-ELEM(12) TO DET-DEC.
           MOVE WS-TOTAL-GENERAL TO DET-TOTAL.
           DISPLAY DETALLE.
           MOVE DETALLE TO ESTADISTICAS-REC.
           WRITE ESTADISTICAS-REC.

       CHEQUEO-CAMBIO-PAGINA.
           ADD 1 TO WS-NRO-LINEA.

           IF (WS-NRO-LINEA >= CANT-LINEAS-POR-PAG)
               MOVE 0 TO WS-NRO-LINEA
               ADD 1 TO WS-HOJA
               PERFORM IMP-ENCABEZADO-ESTADISTICAS
           END-IF.

       CERRAR-ARCHIVOS.
           CLOSE ALQUILERESMAE
                 AUTOS
                 ESTADISTICAS.
